/**
 * 常用正则规则
 * @type {{
     int: 正负整数,
     float: 正负整数|小数,
     email: Email,
     url: URL,
     domain: 域名,
     ip: IP,
     file: 文件名,
     identity: 15或18位身份证号码,
     postal: 邮政编码,
     zh: 中文,
     en: 英文,
     number: 数字,
     en_num: 英文|数字,
     password: 普通密码..6~16个字母|数字|下划线,
     password3: 密码强度3..8~16位同时包含大写|小写|数字|特殊字符,
     password2: 密码强度2..8~16位同时包含大写|小写|数字,
     password1: 密码强度1..6~16位同时包含字母|数字,
     phone: 11位手机号码,
     telephone: 普通电话|传真号码,
     zh_en_num_blank_hyphen: 中文|英文|数字|空格|短横,
     firstNotBlank: 首字母非空格
   }}
 */
const regExp = {
  // 正负整数
  int: /^-?\d+$/,
  // 正负整数、小数
  float: /^(-?\d+)(\.\d+)?$/,
  // Email
  email: /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
  // URL 地址
  url: /^[a-zA-z]+:\/\/(\w+(-\w+)*)(\.(\w+(-\w+)*))*(\?\S*)?$/,
  // 域名
  domain: /[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\.?/,
  // IP
  ip: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])$/,
  // 文件名
  file: /^((\w+)(\.{1})(\w+))$/,
  // 身份证号码
  identity: /^[1-9]{1}[0-9]{14}$|^[1-9]{1}[0-9]{16}([0-9]|[xX])$/,
  // 邮政编码6位
  postal: /[1-9]\d{5}(?!\d)/,
  // 中文
  zh: /^[\u4e00-\u9fa5]+$/,
  // 只能输入英文
  en: /^[a-zA-Z]*$/,
  // 只能输入数字
  number: /^[0-9]*$/,
  // 英文、数字
  en_num: /^[a-zA-Z0-9]*$/,
  // 普通密码，只能输入6-16个字母、数字、下划线
  password: /^(\w){6,16}$/,
  // 密码强度3，8-16位同时包含大写、小写、数字、特殊字符!@#$%^&*?
  password3: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[!@#$%^&*?])[A-Za-z\d!@#$%^&*?]{8,16}/,
  // 密码强度2，8-16位同时包含大写、小写、数字
  password2: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)[a-zA-Z\d]{8,16}$/,
  // 密码强度1，必须包含字母和数字，6-16位
  password1: /^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{6,16}$/,
  // 手机号码11位
  phone: /^1[3-578]\d{9}$/,
  // 判断普通电话、传真号码：可以“+”开头，除数字外，可含有“-”
  telephone: /^[+]{0,1}(\d){1,3}[ ]?([-]?((\d)|[ ]){1,12})+$/,
  // 只能输入中英文、数字、空格、‘-’
  zh_en_num_blank_hyphen: /^[\u4e00-\u9fa5a-zA-Z0-9\s-]+$/,
  // 首位不能是空格
  firstNotBlank: /^[^ ]+[\s\S]*/
}

module.exports = regExp
